In [55]:
import pandas as pd
import numpy as np

# Series

```python
1.Series 由一组索引和一组Numpy的数据组成
2.索引：obj.index
  1）默认索引
  2）指定索引
  3）通过字典创建
  4）通过赋值的方式就地修改
3.通过索引取一个值或者几个值
4.numpy运算都会保留索引和数值之间的连接
5.pd.isnull pd.notnull
  obj.isnull obj.notnull
  obj.name = ''
  obj.index.name = ''
  
  pd.isnull 是pd.isna 的同义词
```

In [24]:
obj = pd.Series([4, 7, -5, 3])

In [25]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [26]:
obj.values

array([ 4,  7, -5,  3])

In [27]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
obj > 0

0     True
1     True
2    False
3     True
dtype: bool

In [29]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [30]:
sdata = {"Ohio":35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [31]:
obj3 = pd.Series(sdata)

In [32]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [33]:
type(obj3)

pandas.core.series.Series

In [34]:
t = pd.isnull(obj3)

In [35]:
t

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [36]:
pd.isnull

In [37]:
pd.isna

In [38]:
pd.isnull == pd.isna

True

In [39]:
id(pd.isnull)

4361373080

In [40]:
id(pd.isna)

4361373080

In [45]:
df = pd.DataFrame({'t1': ['a', 'b', 'c', ''],
                   't2': ['a', np.nan, '', 'd'],
                   't3': ['a', 'b', 'c', 'd']})

In [46]:
df

  t1   t2 t3
0  a    a  a
1  b  NaN  b
2  c       c
3       d  d

In [47]:
df['new'] = df['t1'] + df['t2'] + df['t3']

In [48]:
df

  t1   t2 t3  new
0  a    a  a  aaa
1  b  NaN  b  NaN
2  c       c   cc
3       d  d   dd

In [50]:
df['t2'].isna()  # '' 不是NaN

0    False
1     True
2    False
3    False
Name: t2, dtype: bool

In [51]:
df['t2'].isnull()

0    False
1     True
2    False
3    False
Name: t2, dtype: bool

In [52]:
df[df['t2'].isnull()]    # 选择第二行

  t1   t2 t3  new
1  b  NaN  b  NaN

In [53]:
df['t2'] == ''

0    False
1    False
2     True
3    False
Name: t2, dtype: bool

In [54]:
df[df['t2'] == '']

  t1 t2 t3 new
2  c     c  cc

# DataFrame

In [56]:
# 1.构建DataFrame
#  传入一个等长列表或者Numpy数组组成的字典

In [58]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year':[2000, 2001, 2002, 2001, 2002],
        'pop':[1.5, 1.7, 3.6, 4.8, 5.0]}

pd.DataFrame(data)   # 字典列表类型

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  4.8
4  Nevada  2002  5.0

In [60]:
# 根据columns指定列的顺序
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  4.8
4  2002  Nevada  5.0

In [64]:
df = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])   # 默认值NaN

In [65]:
df

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  4.8  NaN
five   2002  Nevada  5.0  NaN

In [67]:
# 取列
df['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [70]:
# loc: 用index名称获取行
# iloc: 用index的的具体位置(只能是整数)获取行
df.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [71]:
df.iloc[0: 3]

       year state  pop debt
one    2000  Ohio  1.5  NaN
two    2001  Ohio  1.7  NaN
three  2002  Ohio  3.6  NaN

In [73]:
df.loc[['one', 'two']]

     year state  pop debt
one  2000  Ohio  1.5  NaN
two  2001  Ohio  1.7  NaN

In [74]:
df.loc[:, ['year']]

       year
one    2000
two    2001
three  2002
four   2001
five   2002

In [75]:
df

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  4.8  NaN
five   2002  Nevada  5.0  NaN

In [79]:
df['debt'] = np.arange(5)

In [80]:
df

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  4.8     3
five   2002  Nevada  5.0     4

In [82]:
val = pd.Series([-1.2, -3.5, 4.0], index = ['two', 'four', 'five'])

In [83]:
val

two    -1.2
four   -3.5
five    4.0
dtype: float64

In [86]:
# 整列都替换掉，如果index没有覆盖的地方，则默认值为NaN
df['dept'] = val

In [87]:
df

       year   state  pop  debt  dept
one    2000    Ohio  1.5     0   NaN
two    2001    Ohio  1.7     1  -1.2
three  2002    Ohio  3.6     2   NaN
four   2001  Nevada  4.8     3  -3.5
five   2002  Nevada  5.0     4   4.0

In [89]:
# # 嵌套字典（外层键作为列，内层键作为行，内层字典的键会自动合并）
pop = {"Nevada": {2001: 2.4, 2002: 2.9}, "Ohio": {2000: 1.5, 2001: 1.7, 
2002: 3.7}}

In [93]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.7}}

In [98]:
# pd.DataFrame(pop, index=[2001,2002,2003])
df3 = pd.DataFrame(pop)

In [99]:
df3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.7

In [100]:
df3.index.name = 'year'
df3.columns.name = 'state'

In [101]:
df3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.7

In [122]:
df3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.7]])

In [131]:
# 矩阵创建DataFrame

df = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [132]:
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [133]:
# 重建索引: 行索引
df1 = df.reindex(['a', 'b', 'c', 'd'])

pd.DataFrame(pop, index=[2001,2002,2003])

In [134]:
df1

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [135]:
# 重建索引: 列索引
df2 = df.reindex(columns=['Texas', 'Ohio', 'California'])

In [136]:
df2

   Texas  Ohio  California
a      1     0           2
c      4     3           5
d      7     6           8

In [141]:
df.reindex(index=['a', 'b', 'c', 'd'], method='ffill')		# 行/列索引，默认值

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [139]:
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

# 索引对象

```python
# pandas索引对象负责管理轴标签和其他数据(比如轴名称)
# 1. 主要索引对象
# In [42]: pd.I					# pandas主要index对象
# pd.Index       pd.IndexSlice  pd.Int64Index
# In [42]: pd.MultiIndex				# pandas主要index对象
# In [42]: pd.DatetimeIndex			# pandas主要index对象
# pd.DatetimeIndex
# In [42]: pd.Period				# pandas主要index对象
# pd.Period       pd.PeriodIndex


# 2. Index的属性和方法
# append						# 连接另一个Index对象
# diff
# intersection
# union
# isin						# 一个指示各值是否包含在参数集合中的布尔数组
# delete
# drop
# insert
# is_monotonic
# is_unique
# unique
```

In [111]:
# 1. 重新索引（reindex）
s = pd.Series([4.5, 7.2, -2.1, 9.0], index=['d', 'b', 'a', 'c'])

In [112]:
s

d    4.5
b    7.2
a   -2.1
c    9.0
dtype: float64

In [114]:
# 重新索引(默认值NaN)
s1 = s.reindex(['a', 'b', 'c', 'd', 'e'])

In [115]:
s1

a   -2.1
b    7.2
c    9.0
d    4.5
e    NaN
dtype: float64

In [116]:
# 填充默认值
s.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -2.1
b    7.2
c    9.0
d    4.5
e    0.0
dtype: float64

In [117]:
s2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [118]:
s2

0      blue
2    purple
4    yellow
dtype: object

In [119]:
s2.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [120]:
# 向前填充
s2.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [121]:
# 向后填充
s2.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object